AchimPieters/esp32-homekit-Sunshade/main/main.c
        if (target == (uint8_t)(pos_f + 0.5f)) {
                movement_finalize();
                return;
        }
        xTaskCreate(move_task, "move", 3072, (void *)(intptr_t)target, 5, &move_task_handle);
}

// Convenience helpers for fixed targets
static void start_move_open(void) {
        start_move_to(100);
}
static void start_move_close(void) {
        start_move_to(0);
}
static void start_move_mid(void) { // used by STOP double-click
        start_move_to(MID_POSITION);
}

// -----------------------------------------------------------------------------
// HomeKit setters
// -----------------------------------------------------------------------------
static void target_position_set(homekit_value_t value) {
        if (value.format != homekit_format_uint8) return;
        uint8_t t = value.uint8_value;
        ESP_LOGI(MOTOR_TAG, "New target: %u", t);
        start_move_to(t);
}

static void hold_position_set(homekit_value_t value) {
        if (value.format != homekit_format_bool) return;
        if (value.bool_value) {
                ESP_LOGI(MOTOR_TAG, "Hold position (STOP)");
                movement_stop(false);
                pix_state = PIX_STOPPED;
        }
        hold_position.value = HOMEKIT_BOOL(false); // auto-reset to false
        homekit_characteristic_notify(&hold_position, hold_position.value);
}

// -----------------------------------------------------------------------------
// Calibration state machine
// -----------------------------------------------------------------------------
typedef enum {
        CAL_IDLE = 0,
        CAL_ARMED, // activated via STOP long-press
        CAL_RUNNING // measuring (opening while timing)
} calib_state_t;

static calib_state_t calib_state = CAL_IDLE;
static int64_t calib_start_us = 0;

static void calib_enter(void) {
        if (calib_state != CAL_IDLE) return;
        movement_stop(false);
        ESP_LOGI("CAL", "Calibration MODE ON: set shade fully CLOSED, press OPEN to start timing, press STOP when fully OPEN.");
        calib_state = CAL_ARMED;
        pix_state = PIX_CALIBRATING;
}

static void calib_cancel(void) {
        if (calib_state == CAL_IDLE) return;
        ESP_LOGI("CAL", "Calibration CANCELLED");
        motor_all_off();
        calib_state = CAL_IDLE;
        pix_state = PIX_IDLE;
}

static void calib_start_run(void) {
        if (calib_state != CAL_ARMED) return;
        // Assumption: start at fully CLOSED
        ESP_LOGI("CAL", "Calibration START: opening and measuring travel time…");
        calib_start_us = esp_timer_get_time();
        calib_state = CAL_RUNNING;
        // Force fully open movement without altering HomeKit target
        movement_stop(false);
        position_state.value = HOMEKIT_UINT8(1);
        homekit_characteristic_notify(&position_state, position_state.value);
        motor_drive_open(true);
        pix_state = PIX_CALIBRATING;
}

static void calib_finish_on_stop(void) {
        if (calib_state != CAL_RUNNING) return;
        motor_all_off();
        int64_t elapsed = esp_timer_get_time() - calib_start_us; // us
        if (elapsed < 3 * 1000 * 1000) { // < 3s is likely invalid
                ESP_LOGW("CAL", "Measurement too short (%lld us). Aborted.", (long long)elapsed);
                calib_cancel();
                return;
        }
        uint32_t ms = (uint32_t)(elapsed / 1000);
        ESP_LOGI("CAL", "Calibration DONE: full_travel_ms=%" PRIu32, ms);
        full_travel_ms = ms;
        calib_save(ms);

        // Set position = 100 (fully open)
        pos_f = 100.0f;
        current_position.value = HOMEKIT_UINT8(100);
        position_state.value = HOMEKIT_UINT8(2);
        homekit_characteristic_notify(&current_position, current_position.value);
        homekit_characteristic_notify(&position_state, position_state.value);
        if (target_position.value.uint8_value != 100) {
                target_position.value = HOMEKIT_UINT8(100);
                homekit_characteristic_notify(&target_position, target_position.value);
        }

        calib_state = CAL_IDLE;
        pix_state = PIX_IDLE;
}

// -----------------------------------------------------------------------------
// Buttons
// -----------------------------------------------------------------------------

static void btn_open_callback(button_event_t event, void *context) {
        if (event != button_event_single_press) return;
        if (calib_state == CAL_ARMED) { calib_start_run(); return; }
        if (calib_state == CAL_RUNNING) return; // ignore targets during calibration
        start_move_open();
        (void)context;
}

static void btn_close_callback(button_event_t event, void *context) {
        if (event != button_event_single_press) return;
        if (calib_state != CAL_IDLE) return; // ignore during calibration
        start_move_close();
        (void)context;
}

static void btn_stop_callback(button_event_t event, void *context) {
        switch (event) {
        case button_event_single_press:
                if (calib_state == CAL_RUNNING) { calib_finish_on_stop(); break; }
                hold_position_set(HOMEKIT_BOOL(true));
                break;
        case button_event_double_press:
                if (calib_state != CAL_IDLE) break; // ignore during calibration
                ESP_LOGI("BTN", "STOP double-click -> move to %d%%", MID_POSITION);
                start_move_mid();
                break;
        case button_event_long_press:
                if (calib_state == CAL_IDLE) calib_enter();
                else calib_cancel();
                break;
        default:
                break;
        }
        (void)context;
}

static void buttons_init(void) {
        button_active_level_t active_level = CONFIG_BUTTON_ACTIVE_LEVEL ? button_active_high : button_active_low;

        button_config_t cfg_single = button_config_default(active_level);
        button_config_t cfg_stop = button_config_default(active_level);

        cfg_stop.long_press_time = 3000; // ms
        cfg_stop.max_repeat_presses = 2; // enable double press detection

        if (button_create(BTN_OPEN_GPIO, cfg_single, btn_open_callback, NULL)) {
                ESP_LOGE("BTN", "Failed to init OPEN button");
        }
        if (button_create(BTN_CLOSE_GPIO, cfg_single, btn_close_callback, NULL)) {
                ESP_LOGE("BTN", "Failed to init CLOSE button");
        }
        if (button_create(BTN_STOP_GPIO, cfg_stop, btn_stop_callback, NULL)) {
                ESP_LOGE("BTN", "Failed to init STOP button");
        }
}

