AchimPieters/esp32-homekit-Sunshade/main/main.c
// -----------------------------------------------------------------------------
// Accessory & config
// -----------------------------------------------------------------------------
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Woverride-init"
homekit_accessory_t *accessories[] = {
        HOMEKIT_ACCESSORY(.id = 1,
                          .category = homekit_accessory_category_window_coverings,
                          .services = (homekit_service_t*[]) {
                // Accessory Information
                HOMEKIT_SERVICE(ACCESSORY_INFORMATION, .characteristics = (homekit_characteristic_t*[]) {
                        &name, &manufacturer, &serial, &model, &revision,
                        HOMEKIT_CHARACTERISTIC(IDENTIFY, accessory_identify),
                        NULL
                }),
                // Window Covering (primary)
                HOMEKIT_SERVICE(WINDOW_COVERING, .primary = true, .characteristics = (homekit_characteristic_t*[]) {
                        HOMEKIT_CHARACTERISTIC(NAME, "Sunshade"),
                        &current_position,
                        HOMEKIT_CHARACTERISTIC(TARGET_POSITION, 0, .setter = target_position_set),
                        &position_state,
                        &obstruction_detected,
                        HOMEKIT_CHARACTERISTIC(HOLD_POSITION, false, .setter = hold_position_set),
                        &ota_trigger,
                        NULL
                }),
                NULL
        }
                          ),
        NULL
};
#pragma GCC diagnostic pop

homekit_server_config_t config = {
        .accessories = accessories,
        .password = CONFIG_ESP_SETUP_CODE,
        .setupId  = CONFIG_ESP_SETUP_ID,
};

// -----------------------------------------------------------------------------
// Wi-Fi/HomeKit bootstrap
// -----------------------------------------------------------------------------
static void on_wifi_ready(void) {
        static bool started = false;
        if (started) return;
        ESP_LOGI("INFO", "Starting HomeKit server…");
        homekit_server_init(&config);
        started = true;
        // From now on, use idle color unless moving
        if (calib_state == CAL_IDLE) pix_state = PIX_IDLE;
}

// -----------------------------------------------------------------------------
// App main
// -----------------------------------------------------------------------------
void app_main(void) {
        // NVS init (for calibration storage)
        ESP_ERROR_CHECK(nvs_flash_init());

        ESP_ERROR_CHECK(lifecycle_nvs_init());
        lifecycle_log_post_reset_state("INFO");
        ESP_ERROR_CHECK(lifecycle_configure_homekit(&revision, &ota_trigger, "INFO"));

        // GPIOs
        gpio_init_led();
        gpio_init_motor();

        // NeoPixel
        neopixel_init();
        pix_state = PIX_WIFI_WAIT;

        // Buttons
        buttons_init();

        // Load calibration
        uint32_t nvs_ms = 0;
        if (calib_load(&nvs_ms) == ESP_OK) {
                full_travel_ms = nvs_ms;
                ESP_LOGI("CAL", "Loaded full_travel_ms from NVS: %" PRIu32 " ms", full_travel_ms);
        } else {
                ESP_LOGW("CAL", "No calibration found; using fallback %" PRIu32 " ms", full_travel_ms);
        }

        // Start Wi-Fi
        esp_err_t wifi_err = wifi_start(on_wifi_ready);
        if (wifi_err == ESP_ERR_NVS_NOT_FOUND) {
                ESP_LOGW("WIFI", "WiFi configuration not found; provisioning required");
        } else if (wifi_err != ESP_OK) {
                ESP_LOGE("WIFI", "Failed to start WiFi: %s", esp_err_to_name(wifi_err));
        }
}
